<!DOCTYPE html>
<html>
	<head>
		<title>jQuery</title>
		<style>
			.extraido{
				float: right;
				width: 250px;
				background-color: yellow;
				font-style: italic;
				padding: 10px;
				margin: 5px;
			}
		</style>
	<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.7.1/jquery.min.js"></script>
    <script>
        $(document).ready(function () {
            $("span").each(
				function(){
					if($(this).hasClass("extraer")){
						console.log(this)
						$(this).addClass("extraido");
					}
				}
			);
        });
    </script>
	</head>
	<body>
		<p><span class='extraer'>
				jQuery es una biblioteca o framework JavaScript
				<span class='omitir'>, es decir, una colecci&oacute;n de funciones</span>
				que nos ayudan a programar de una forma m&aacute;s r&aacute;pida y eficiente.
			</span> 
			De hecho, el lema de jQuery es &quot;hacer m&aacute;s escribiendo menos&quot;. 
			Con las funciones incluidas en jQuery podremos implementar muchas de las t&eacute;cnicas que hemos aprendido en los temas anteriores
			(como gesti&oacute;n del DOM, gesti&oacute;n de eventos y peticiones Ajax), y tambi&eacute;n otras en las que no hemos profundizado 
			porque las incompatibilidades entre navegadores las har&iacute;an muy tediosas de aplicar sin el apoyo de una biblioteca 
			(como animaciones y efectos visuales).
		</p>
		<p>jQuery fue creado en 2006 por John Resig y, desde entonces, ha alcanzado una gran popularidad, estim&aacute;ndose que un 55% 
			de las p&aacute;ginas m&aacute;s visitadas de la web utilizan jQuery. La versi&oacute;n m&aacute;s actual en el momento de 
			escribir este texto es jQuery 3.2.1.
		</p>
		<p>&iquest;Cu&aacute;l es el secreto del &eacute;xito de esta biblioteca?
			No es uno s&oacute;lo, sino un c&uacute;mulo de ellos entre los que destacan que 
			<span class='extraer'>es gratuita, es una biblioteca relativamente poco pesada
				<span class='omitir'> (ocupa poca memoria), crea una capa de abstracci&oacute;n entre las funcionalidades 
					y los navegadores, de modo que el programador puede despreocuparse de las incompatibilidades entre navegadores,
					aprovecha los conocimientos que pudiera tener el usuario sobre CSS para ofrecerle un m&eacute;todo de selecci&oacute;n 
					de nodos del DOM muy refinado, puede ampliarse a trav&eacute;s de plugins
				</span>
			, y su c&oacute;digo es compacto, eficiente y muy depurado.
			</span>
		</p>
	<body>
</html>
